extension StringExtension on String {
  String get replaceAllDiacritics => replaceAllMapped(RegExp('[^\u0000-\u007E]', multiLine: true), (m) => diacriticsMapping[m.group(0)] ?? "");
}

const diacriticsMapping = {
    "à":"a","ả":"a","ã":"a","á":"a","ạ":"a","ă":"a","ằ":"a","ẳ":"a","ẵ":"a","ắ":"a","ặ":"a","â":"a","ầ":"a","ẩ":"a","ẫ":"a","ấ":"a","ậ":"a","è":"e","ẻ":"e","ẽ":"e","é":"e","ẹ":"e","ê":"e","ề":"e","ể":"e","ễ":"e","ế":"e","ệ":"e","đ":"d","ì":"i","ỉ":"i","ĩ":"i","í":"i","ị":"i","ò":"o","ỏ":"o","õ":"o","ó":"o","ọ":"o","ô":"o","ồ":"o","ổ":"o","ỗ":"o","ố":"o","ộ":"o","ơ":"o","ờ":"o","ở":"o","ỡ":"o","ớ":"o","ợ":"o","ù":"u","ủ":"u","ũ":"u","ú":"u","ụ":"u","ư":"u","ừ":"u","ử":"u","ữ":"u","ứ":"u","ự":"u","ỳ":"y","ỷ":"y","ỹ":"y","ý":"y","ỵ":"y"
  };